ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/pio.h
/* ---------------------------------------------------------------------------- */
/*                Microchip Microcontroller Software Support                    */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2021, Microchip Technology Inc.                                */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Microchip's name may not be used to endorse or promote products derived from */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS  */
/* OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES */
/* OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT    */
/* ARE DISCLAIMED. IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT,        */
/* INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES           */
/* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; */
/* LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND  */
/* ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   */
/* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF     */
/* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.            */
/* ---------------------------------------------------------------------------- */

#ifndef _PIC32CX_PIO_COMPONENT_
#define _PIC32CX_PIO_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR Parallel Input/Output Controller */
/* ============================================================================= */
/** \addtogroup PIC32CX_PIO0 Parallel Input/Output Controller */
/*@{*/

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PioIo_group hardware registers */
typedef struct {
	__IO uint32_t PIO_MSKR; /**< \brief (PioIo_group Offset: 0x0) PIO Mask Register */
	__IO uint32_t PIO_CFGR; /**< \brief (PioIo_group Offset: 0x4) PIO Configuration Register */
	__I uint32_t PIO_PDSR; /**< \brief (PioIo_group Offset: 0x8) PIO Pin Data Status Register */
	__I uint32_t PIO_LOCKSR; /**< \brief (PioIo_group Offset: 0xC) PIO Lock Status Register */
	__O uint32_t PIO_SODR; /**< \brief (PioIo_group Offset: 0x10) PIO Set Output Data Register */
	__O uint32_t PIO_CODR; /**< \brief (PioIo_group Offset: 0x14) PIO Clear Output Data Register */
	__IO uint32_t PIO_ODSR; /**< \brief (PioIo_group Offset: 0x18) PIO Output Data Status Register */
	__I uint32_t Reserved1[1];
	__O uint32_t PIO_IER; /**< \brief (PioIo_group Offset: 0x20) PIO Interrupt Enable Register */
	__O uint32_t PIO_IDR; /**< \brief (PioIo_group Offset: 0x24) PIO Interrupt Disable Register */
	__I uint32_t PIO_IMR; /**< \brief (PioIo_group Offset: 0x28) PIO Interrupt Mask Register */
	__I uint32_t PIO_ISR; /**< \brief (PioIo_group Offset: 0x2C) PIO Interrupt Status Register */
	__I uint32_t Reserved2[3];
	__O uint32_t PIO_IOFR; /**< \brief (PioIo_group Offset: 0x3C) PIO I/O Freeze Configuration Register */
} PioGroup;
/** \brief Pio hardware registers */
typedef struct {
	__IO uint32_t PIO_P_MSKR; /**< \brief (PioP Offset: 0x0) PIO Privilege Mask Register */
	__IO uint32_t PIO_P_CFGR; /**< \brief (PioP Offset: 0x4) PIO Privilege Configuration Register */
	__I uint32_t PIO_P_PDSR; /**< \brief (PioP Offset: 0x8) PIO Privilege Pin Data Status Register */
	__I uint32_t PIO_P_LOCKSR; /**< \brief (PioP Offset: 0xC) PIO Privilege Lock Status Register */
	__O uint32_t PIO_P_SODR; /**< \brief (PioP Offset: 0x10) PIO Privilege Set Output Data Register */
	__O uint32_t PIO_P_CODR; /**< \brief (PioP Offset: 0x14) PIO Privilege Clear Output Data Register */
	__IO uint32_t PIO_P_ODSR; /**< \brief (PioP Offset: 0x18) PIO Privilege Output Data Status Register */
	__I uint32_t Reserved1[1];
	__O uint32_t PIO_P_IER; /**< \brief (PioP Offset: 0x20) PIO Privilege Interrupt Enable Register */
	__O uint32_t PIO_P_IDR; /**< \brief (PioP Offset: 0x24) PIO Privilege Interrupt Disable Register */
	__I uint32_t PIO_P_IMR; /**< \brief (PioP Offset: 0x28) PIO Privilege Interrupt Mask Register */
	__I uint32_t PIO_P_ISR; /**< \brief (PioP Offset: 0x2C) PIO Privilege Interrupt Status Register */
	__O uint32_t PIO_P_SIO_UAR; /**< \brief (PioP Offset: 0x30) PIO Privilege Set I/O User Register */
	__O uint32_t PIO_P_SIO_PAR; /**< \brief (PioP Offset: 0x34) PIO Privilege Set I/O Privilege Register */
	__I uint32_t PIO_P_IOSSR; /**< \brief (PioP Offset: 0x38) PIO Privilege I/O Security Status Register */
	__O uint32_t PIO_P_IOFR; /**< \brief (PioP Offset: 0x3C) PIO Privilege I/O Freeze Configuration Register */
} PioP;
/** \brief Pio hardware registers */
#define PIO_GROUP_NUMBER     3
#define PIO_PGROUP_NUMBER    3
typedef struct {
	PioGroup PIO_GROUP[PIO_GROUP_NUMBER];                 /**< \brief (Pio0 Offset: 0x0) io_group = 0 .. 2 */
	__I  uint32_t     Reserved1[328];
	__IO uint32_t     PIO_WPMR;                           /**< \brief (Pio0 Offset: 0x5E0) PIO Write Protection Mode Register */
	__I  uint32_t     PIO_WPSR;                           /**< \brief (Pio0 Offset: 0x5E4) PIO Write Protection Status Register */
	__I  uint32_t     Reserved3[646];
	PioP         PIO_P[PIO_PGROUP_NUMBER];                /**< \brief (Pio0 Offset: 0x1000) pgroup = 0 .. 2 */
	__I  uint32_t     Reserved4[272];
	__IO uint32_t     PIO_P_SCDR;                         /**< \brief (Pio0 Offset: 0x1500) PIO Privilege Slow Clock Divider Debouncing Register */
	__I  uint32_t     Reserved5[55];
	__IO uint32_t     PIO_P_WPMR;                         /**< \brief (Pio0 Offset: 0x15E0) PIO Privilege Write Protection Mode Register */
	__I  uint32_t     PIO_P_WPSR;                         /**< \brief (Pio0 Offset: 0x15E4) PIO Privilege Write Protection Status Register */
} Pio;
