ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/pio.h
#define   PIO_P_MSKR_MSK5_ENABLED (0x1u << 5) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK6 (0x1u << 6) /**< \brief (PIO_P_MSKR) PIO Line 6 Mask */
#define   PIO_P_MSKR_MSK6_DISABLED (0x0u << 6) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK6_ENABLED (0x1u << 6) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK7 (0x1u << 7) /**< \brief (PIO_P_MSKR) PIO Line 7 Mask */
#define   PIO_P_MSKR_MSK7_DISABLED (0x0u << 7) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK7_ENABLED (0x1u << 7) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK8 (0x1u << 8) /**< \brief (PIO_P_MSKR) PIO Line 8 Mask */
#define   PIO_P_MSKR_MSK8_DISABLED (0x0u << 8) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK8_ENABLED (0x1u << 8) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK9 (0x1u << 9) /**< \brief (PIO_P_MSKR) PIO Line 9 Mask */
#define   PIO_P_MSKR_MSK9_DISABLED (0x0u << 9) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK9_ENABLED (0x1u << 9) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK10 (0x1u << 10) /**< \brief (PIO_P_MSKR) PIO Line 10 Mask */
#define   PIO_P_MSKR_MSK10_DISABLED (0x0u << 10) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK10_ENABLED (0x1u << 10) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK11 (0x1u << 11) /**< \brief (PIO_P_MSKR) PIO Line 11 Mask */
#define   PIO_P_MSKR_MSK11_DISABLED (0x0u << 11) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK11_ENABLED (0x1u << 11) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK12 (0x1u << 12) /**< \brief (PIO_P_MSKR) PIO Line 12 Mask */
#define   PIO_P_MSKR_MSK12_DISABLED (0x0u << 12) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK12_ENABLED (0x1u << 12) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK13 (0x1u << 13) /**< \brief (PIO_P_MSKR) PIO Line 13 Mask */
#define   PIO_P_MSKR_MSK13_DISABLED (0x0u << 13) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK13_ENABLED (0x1u << 13) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK14 (0x1u << 14) /**< \brief (PIO_P_MSKR) PIO Line 14 Mask */
#define   PIO_P_MSKR_MSK14_DISABLED (0x0u << 14) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK14_ENABLED (0x1u << 14) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK15 (0x1u << 15) /**< \brief (PIO_P_MSKR) PIO Line 15 Mask */
#define   PIO_P_MSKR_MSK15_DISABLED (0x0u << 15) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK15_ENABLED (0x1u << 15) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK16 (0x1u << 16) /**< \brief (PIO_P_MSKR) PIO Line 16 Mask */
#define   PIO_P_MSKR_MSK16_DISABLED (0x0u << 16) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK16_ENABLED (0x1u << 16) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK17 (0x1u << 17) /**< \brief (PIO_P_MSKR) PIO Line 17 Mask */
#define   PIO_P_MSKR_MSK17_DISABLED (0x0u << 17) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK17_ENABLED (0x1u << 17) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK18 (0x1u << 18) /**< \brief (PIO_P_MSKR) PIO Line 18 Mask */
#define   PIO_P_MSKR_MSK18_DISABLED (0x0u << 18) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK18_ENABLED (0x1u << 18) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK19 (0x1u << 19) /**< \brief (PIO_P_MSKR) PIO Line 19 Mask */
#define   PIO_P_MSKR_MSK19_DISABLED (0x0u << 19) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK19_ENABLED (0x1u << 19) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK20 (0x1u << 20) /**< \brief (PIO_P_MSKR) PIO Line 20 Mask */
#define   PIO_P_MSKR_MSK20_DISABLED (0x0u << 20) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK20_ENABLED (0x1u << 20) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK21 (0x1u << 21) /**< \brief (PIO_P_MSKR) PIO Line 21 Mask */
#define   PIO_P_MSKR_MSK21_DISABLED (0x0u << 21) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK21_ENABLED (0x1u << 21) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK22 (0x1u << 22) /**< \brief (PIO_P_MSKR) PIO Line 22 Mask */
#define   PIO_P_MSKR_MSK22_DISABLED (0x0u << 22) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK22_ENABLED (0x1u << 22) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK23 (0x1u << 23) /**< \brief (PIO_P_MSKR) PIO Line 23 Mask */
#define   PIO_P_MSKR_MSK23_DISABLED (0x0u << 23) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK23_ENABLED (0x1u << 23) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK24 (0x1u << 24) /**< \brief (PIO_P_MSKR) PIO Line 24 Mask */
#define   PIO_P_MSKR_MSK24_DISABLED (0x0u << 24) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK24_ENABLED (0x1u << 24) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK25 (0x1u << 25) /**< \brief (PIO_P_MSKR) PIO Line 25 Mask */
#define   PIO_P_MSKR_MSK25_DISABLED (0x0u << 25) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK25_ENABLED (0x1u << 25) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK26 (0x1u << 26) /**< \brief (PIO_P_MSKR) PIO Line 26 Mask */
#define   PIO_P_MSKR_MSK26_DISABLED (0x0u << 26) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK26_ENABLED (0x1u << 26) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK27 (0x1u << 27) /**< \brief (PIO_P_MSKR) PIO Line 27 Mask */
#define   PIO_P_MSKR_MSK27_DISABLED (0x0u << 27) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK27_ENABLED (0x1u << 27) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK28 (0x1u << 28) /**< \brief (PIO_P_MSKR) PIO Line 28 Mask */
#define   PIO_P_MSKR_MSK28_DISABLED (0x0u << 28) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK28_ENABLED (0x1u << 28) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK29 (0x1u << 29) /**< \brief (PIO_P_MSKR) PIO Line 29 Mask */
#define   PIO_P_MSKR_MSK29_DISABLED (0x0u << 29) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK29_ENABLED (0x1u << 29) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK30 (0x1u << 30) /**< \brief (PIO_P_MSKR) PIO Line 30 Mask */
#define   PIO_P_MSKR_MSK30_DISABLED (0x0u << 30) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK30_ENABLED (0x1u << 30) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
#define PIO_P_MSKR_MSK31 (0x1u << 31) /**< \brief (PIO_P_MSKR) PIO Line 31 Mask */
#define   PIO_P_MSKR_MSK31_DISABLED (0x0u << 31) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRx does not affect the corresponding I/O line configuration. */
#define   PIO_P_MSKR_MSK31_ENABLED (0x1u << 31) /**< \brief (PIO_P_MSKR) Writing the PIO_P_CFGRx, PIO_P_ODSRx or PIO_P_IOFRX updates the corresponding I/O line configuration. */
/* -------- PIO_P_CFGR : (PIO0 Offset: N/A) PIO Privilege Configuration Register -------- */
#define PIO_P_CFGR_FUNC_Pos 0
#define PIO_P_CFGR_FUNC_Msk (0x7u << PIO_P_CFGR_FUNC_Pos) /**< \brief (PIO_P_CFGR) I/O Line Function */
#define PIO_P_CFGR_FUNC(value) ((PIO_P_CFGR_FUNC_Msk & ((value) << PIO_P_CFGR_FUNC_Pos)))
#define   PIO_P_CFGR_FUNC_GPIO (0x0u << 0) /**< \brief (PIO_P_CFGR) Select the PIO mode for the selected I/O lines. */
#define   PIO_P_CFGR_FUNC_PERIPH_A (0x1u << 0) /**< \brief (PIO_P_CFGR) Select the peripheral A for the selected I/O lines. */
#define   PIO_P_CFGR_FUNC_PERIPH_B (0x2u << 0) /**< \brief (PIO_P_CFGR) Select the peripheral B for the selected I/O lines. */
#define   PIO_P_CFGR_FUNC_PERIPH_C (0x3u << 0) /**< \brief (PIO_P_CFGR) Select the peripheral C for the selected I/O lines. */
#define   PIO_P_CFGR_FUNC_PERIPH_D (0x4u << 0) /**< \brief (PIO_P_CFGR) Select the peripheral D for the selected I/O lines. */
#define PIO_P_CFGR_DIR (0x1u << 8) /**< \brief (PIO_P_CFGR) Direction */
#define   PIO_P_CFGR_DIR_INPUT (0x0u << 8) /**< \brief (PIO_P_CFGR) The selected I/O lines are pure inputs. */
#define   PIO_P_CFGR_DIR_OUTPUT (0x1u << 8) /**< \brief (PIO_P_CFGR) The selected I/O lines are enabled in output. */
#define PIO_P_CFGR_PUEN (0x1u << 9) /**< \brief (PIO_P_CFGR) Pull-Up Enable */
#define   PIO_P_CFGR_PUEN_DISABLED (0x0u << 9) /**< \brief (PIO_P_CFGR) Pull-Up is disabled for the selected I/O lines. */
#define   PIO_P_CFGR_PUEN_ENABLED (0x1u << 9) /**< \brief (PIO_P_CFGR) Pull-Up is enabled for the selected I/O lines. */
#define PIO_P_CFGR_PDEN (0x1u << 10) /**< \brief (PIO_P_CFGR) Pull-Down Enable */
#define   PIO_P_CFGR_PDEN_DISABLED (0x0u << 10) /**< \brief (PIO_P_CFGR) Pull-Down is disabled for the selected I/O lines. */
#define   PIO_P_CFGR_PDEN_ENABLED (0x1u << 10) /**< \brief (PIO_P_CFGR) Pull-Down is enabled for the selected I/O lines only if PUEN is 0. */
#define PIO_P_CFGR_IFEN (0x1u << 12) /**< \brief (PIO_P_CFGR) Input Filter Enable */
#define   PIO_P_CFGR_IFEN_DISABLED (0x0u << 12) /**< \brief (PIO_P_CFGR) The input filter is disabled for the selected I/O lines. */
#define   PIO_P_CFGR_IFEN_ENABLED (0x1u << 12) /**< \brief (PIO_P_CFGR) The input filter is enabled for the selected I/O lines. */
#define PIO_P_CFGR_IFSCEN (0x1u << 13) /**< \brief (PIO_P_CFGR) Input Filter Slow Clock Enable */
#define PIO_P_CFGR_OPD (0x1u << 14) /**< \brief (PIO_P_CFGR) Open-Drain */
#define   PIO_P_CFGR_OPD_DISABLED (0x0u << 14) /**< \brief (PIO_P_CFGR) The open-drain is disabled for the selected I/O lines. I/O lines are driven at high- and low-level. */
#define   PIO_P_CFGR_OPD_ENABLED (0x1u << 14) /**< \brief (PIO_P_CFGR) The open-drain is enabled for the selected I/O lines. I/O lines are driven at low-level only. */
#define PIO_P_CFGR_SCHMITT (0x1u << 15) /**< \brief (PIO_P_CFGR) Schmitt Trigger */
#define   PIO_P_CFGR_SCHMITT_ENABLED (0x0u << 15) /**< \brief (PIO_P_CFGR) Schmitt trigger is enabled for the selected I/O lines. */
#define   PIO_P_CFGR_SCHMITT_LO (0x0u << 15) /**< \brief (PIO_P_CFGR) drive */
#define   PIO_P_CFGR_SCHMITT_DISABLED (0x1u << 15) /**< \brief (PIO_P_CFGR) Schmitt trigger is disabled for the selected I/O lines. */
#define PIO_P_CFGR_SLEWRATE_Pos 16
#define PIO_P_CFGR_SLEWRATE_Msk (0x3u << PIO_P_CFGR_SLEWRATE_Pos) /**< \brief (PIO_P_CFGR) Slew Rate */
#define PIO_P_CFGR_SLEWRATE(value) ((PIO_P_CFGR_SLEWRATE_Msk & ((value) << PIO_P_CFGR_SLEWRATE_Pos)))
#define   PIO_P_CFGR_SLEWRATE_FAST (0x0u << 16) /**< \brief (PIO_P_CFGR) Slow slew rate */
#define   PIO_P_CFGR_SLEWRATE_MEDIUMFAST (0x1u << 16) /**< \brief (PIO_P_CFGR) Medium-fast slew rate */
#define   PIO_P_CFGR_SLEWRATE_MEDIUM (0x2u << 16) /**< \brief (PIO_P_CFGR) Medium slew rate */
#define   PIO_P_CFGR_SLEWRATE_SLOW (0x3u << 16) /**< \brief (PIO_P_CFGR) Slow slew rate */
#define PIO_P_CFGR_EVTSEL_Pos 24
#define PIO_P_CFGR_EVTSEL_Msk (0x7u << PIO_P_CFGR_EVTSEL_Pos) /**< \brief (PIO_P_CFGR) Event Selection */
#define PIO_P_CFGR_EVTSEL(value) ((PIO_P_CFGR_EVTSEL_Msk & ((value) << PIO_P_CFGR_EVTSEL_Pos)))
#define   PIO_P_CFGR_EVTSEL_FALLING (0x0u << 24) /**< \brief (PIO_P_CFGR) Event detection on input falling edge */
#define   PIO_P_CFGR_EVTSEL_RISING (0x1u << 24) /**< \brief (PIO_P_CFGR) Event detection on input rising edge */
#define   PIO_P_CFGR_EVTSEL_BOTH (0x2u << 24) /**< \brief (PIO_P_CFGR) Event detection on input both edge */
#define   PIO_P_CFGR_EVTSEL_LOW (0x3u << 24) /**< \brief (PIO_P_CFGR) Event detection on low level input */
#define   PIO_P_CFGR_EVTSEL_HIGH (0x4u << 24) /**< \brief (PIO_P_CFGR) Event detection on high level input */
#define PIO_P_CFGR_PCFS (0x1u << 29) /**< \brief (PIO_P_CFGR) Physical Configuration Freeze Status (read-only) */
#define   PIO_P_CFGR_PCFS_NOT_FROZEN (0x0u << 29) /**< \brief (PIO_P_CFGR) The fields are not frozen and can be written for this I/O line. */
#define   PIO_P_CFGR_PCFS_FROZEN (0x1u << 29) /**< \brief (PIO_P_CFGR) The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields. */
#define PIO_P_CFGR_ICFS (0x1u << 30) /**< \brief (PIO_P_CFGR) Interrupt Configuration Freeze Status (read-only) */
#define   PIO_P_CFGR_ICFS_NOT_FROZEN (0x0u << 30) /**< \brief (PIO_P_CFGR) The fields are not frozen and can be written for this I/O line. */
#define   PIO_P_CFGR_ICFS_FROZEN (0x1u << 30) /**< \brief (PIO_P_CFGR) The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields. */
/* -------- PIO_P_PDSR : (PIO0 Offset: N/A) PIO Privilege Pin Data Status Register -------- */
#define PIO_P_PDSR_P0 (0x1u << 0) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P1 (0x1u << 1) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P2 (0x1u << 2) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P3 (0x1u << 3) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P4 (0x1u << 4) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P5 (0x1u << 5) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P6 (0x1u << 6) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P7 (0x1u << 7) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P8 (0x1u << 8) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P9 (0x1u << 9) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P10 (0x1u << 10) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P11 (0x1u << 11) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P12 (0x1u << 12) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P13 (0x1u << 13) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P14 (0x1u << 14) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P15 (0x1u << 15) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P16 (0x1u << 16) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P17 (0x1u << 17) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P18 (0x1u << 18) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P19 (0x1u << 19) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P20 (0x1u << 20) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P21 (0x1u << 21) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P22 (0x1u << 22) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P23 (0x1u << 23) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P24 (0x1u << 24) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P25 (0x1u << 25) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P26 (0x1u << 26) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P27 (0x1u << 27) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P28 (0x1u << 28) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P29 (0x1u << 29) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P30 (0x1u << 30) /**< \brief (PIO_P_PDSR) Input Data Status */
#define PIO_P_PDSR_P31 (0x1u << 31) /**< \brief (PIO_P_PDSR) Input Data Status */
/* -------- PIO_P_LOCKSR : (PIO0 Offset: N/A) PIO Privilege Lock Status Register -------- */
#define PIO_P_LOCKSR_P0 (0x1u << 0) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P1 (0x1u << 1) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P2 (0x1u << 2) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P3 (0x1u << 3) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P4 (0x1u << 4) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P5 (0x1u << 5) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P6 (0x1u << 6) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P7 (0x1u << 7) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P8 (0x1u << 8) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P9 (0x1u << 9) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P10 (0x1u << 10) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P11 (0x1u << 11) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P12 (0x1u << 12) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P13 (0x1u << 13) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P14 (0x1u << 14) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P15 (0x1u << 15) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P16 (0x1u << 16) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P17 (0x1u << 17) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P18 (0x1u << 18) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P19 (0x1u << 19) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P20 (0x1u << 20) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P21 (0x1u << 21) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P22 (0x1u << 22) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P23 (0x1u << 23) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P24 (0x1u << 24) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P25 (0x1u << 25) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P26 (0x1u << 26) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P27 (0x1u << 27) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P28 (0x1u << 28) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P29 (0x1u << 29) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P30 (0x1u << 30) /**< \brief (PIO_P_LOCKSR) Lock Status */
#define PIO_P_LOCKSR_P31 (0x1u << 31) /**< \brief (PIO_P_LOCKSR) Lock Status */
/* -------- PIO_P_SODR : (PIO0 Offset: N/A) PIO Privilege Set Output Data Register -------- */
#define PIO_P_SODR_P0 (0x1u << 0) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P1 (0x1u << 1) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P2 (0x1u << 2) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P3 (0x1u << 3) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P4 (0x1u << 4) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P5 (0x1u << 5) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P6 (0x1u << 6) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P7 (0x1u << 7) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P8 (0x1u << 8) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P9 (0x1u << 9) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P10 (0x1u << 10) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P11 (0x1u << 11) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P12 (0x1u << 12) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P13 (0x1u << 13) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P14 (0x1u << 14) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P15 (0x1u << 15) /**< \brief (PIO_P_SODR) Set Output Data */
