ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/pio.h
#define PIO_P_SODR_P16 (0x1u << 16) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P17 (0x1u << 17) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P18 (0x1u << 18) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P19 (0x1u << 19) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P20 (0x1u << 20) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P21 (0x1u << 21) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P22 (0x1u << 22) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P23 (0x1u << 23) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P24 (0x1u << 24) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P25 (0x1u << 25) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P26 (0x1u << 26) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P27 (0x1u << 27) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P28 (0x1u << 28) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P29 (0x1u << 29) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P30 (0x1u << 30) /**< \brief (PIO_P_SODR) Set Output Data */
#define PIO_P_SODR_P31 (0x1u << 31) /**< \brief (PIO_P_SODR) Set Output Data */
/* -------- PIO_P_CODR : (PIO0 Offset: N/A) PIO Privilege Clear Output Data Register -------- */
#define PIO_P_CODR_P0 (0x1u << 0) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P1 (0x1u << 1) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P2 (0x1u << 2) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P3 (0x1u << 3) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P4 (0x1u << 4) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P5 (0x1u << 5) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P6 (0x1u << 6) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P7 (0x1u << 7) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P8 (0x1u << 8) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P9 (0x1u << 9) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P10 (0x1u << 10) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P11 (0x1u << 11) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P12 (0x1u << 12) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P13 (0x1u << 13) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P14 (0x1u << 14) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P15 (0x1u << 15) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P16 (0x1u << 16) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P17 (0x1u << 17) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P18 (0x1u << 18) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P19 (0x1u << 19) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P20 (0x1u << 20) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P21 (0x1u << 21) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P22 (0x1u << 22) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P23 (0x1u << 23) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P24 (0x1u << 24) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P25 (0x1u << 25) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P26 (0x1u << 26) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P27 (0x1u << 27) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P28 (0x1u << 28) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P29 (0x1u << 29) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P30 (0x1u << 30) /**< \brief (PIO_P_CODR) Clear Output Data */
#define PIO_P_CODR_P31 (0x1u << 31) /**< \brief (PIO_P_CODR) Clear Output Data */
/* -------- PIO_P_ODSR : (PIO0 Offset: N/A) PIO Privilege Output Data Status Register -------- */
#define PIO_P_ODSR_P0 (0x1u << 0) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P1 (0x1u << 1) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P2 (0x1u << 2) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P3 (0x1u << 3) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P4 (0x1u << 4) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P5 (0x1u << 5) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P6 (0x1u << 6) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P7 (0x1u << 7) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P8 (0x1u << 8) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P9 (0x1u << 9) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P10 (0x1u << 10) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P11 (0x1u << 11) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P12 (0x1u << 12) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P13 (0x1u << 13) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P14 (0x1u << 14) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P15 (0x1u << 15) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P16 (0x1u << 16) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P17 (0x1u << 17) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P18 (0x1u << 18) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P19 (0x1u << 19) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P20 (0x1u << 20) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P21 (0x1u << 21) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P22 (0x1u << 22) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P23 (0x1u << 23) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P24 (0x1u << 24) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P25 (0x1u << 25) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P26 (0x1u << 26) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P27 (0x1u << 27) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P28 (0x1u << 28) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P29 (0x1u << 29) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P30 (0x1u << 30) /**< \brief (PIO_P_ODSR) Output Data Status */
#define PIO_P_ODSR_P31 (0x1u << 31) /**< \brief (PIO_P_ODSR) Output Data Status */
/* -------- PIO_P_IER : (PIO0 Offset: N/A) PIO Privilege Interrupt Enable Register -------- */
#define PIO_P_IER_P0 (0x1u << 0) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P1 (0x1u << 1) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P2 (0x1u << 2) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P3 (0x1u << 3) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P4 (0x1u << 4) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P5 (0x1u << 5) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P6 (0x1u << 6) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P7 (0x1u << 7) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P8 (0x1u << 8) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P9 (0x1u << 9) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P10 (0x1u << 10) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P11 (0x1u << 11) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P12 (0x1u << 12) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P13 (0x1u << 13) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P14 (0x1u << 14) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P15 (0x1u << 15) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P16 (0x1u << 16) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P17 (0x1u << 17) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P18 (0x1u << 18) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P19 (0x1u << 19) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P20 (0x1u << 20) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P21 (0x1u << 21) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P22 (0x1u << 22) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P23 (0x1u << 23) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P24 (0x1u << 24) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P25 (0x1u << 25) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P26 (0x1u << 26) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P27 (0x1u << 27) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P28 (0x1u << 28) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P29 (0x1u << 29) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P30 (0x1u << 30) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
#define PIO_P_IER_P31 (0x1u << 31) /**< \brief (PIO_P_IER) Input Change Interrupt Enable */
/* -------- PIO_P_IDR : (PIO0 Offset: N/A) PIO Privilege Interrupt Disable Register -------- */
#define PIO_P_IDR_P0 (0x1u << 0) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P1 (0x1u << 1) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P2 (0x1u << 2) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P3 (0x1u << 3) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P4 (0x1u << 4) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P5 (0x1u << 5) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P6 (0x1u << 6) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P7 (0x1u << 7) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P8 (0x1u << 8) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P9 (0x1u << 9) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P10 (0x1u << 10) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P11 (0x1u << 11) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P12 (0x1u << 12) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P13 (0x1u << 13) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P14 (0x1u << 14) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P15 (0x1u << 15) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P16 (0x1u << 16) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P17 (0x1u << 17) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P18 (0x1u << 18) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P19 (0x1u << 19) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P20 (0x1u << 20) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P21 (0x1u << 21) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P22 (0x1u << 22) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P23 (0x1u << 23) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P24 (0x1u << 24) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P25 (0x1u << 25) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P26 (0x1u << 26) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P27 (0x1u << 27) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P28 (0x1u << 28) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P29 (0x1u << 29) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P30 (0x1u << 30) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
#define PIO_P_IDR_P31 (0x1u << 31) /**< \brief (PIO_P_IDR) Input Change Interrupt Disable */
/* -------- PIO_P_IMR : (PIO0 Offset: N/A) PIO Privilege Interrupt Mask Register -------- */
#define PIO_P_IMR_P0 (0x1u << 0) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P1 (0x1u << 1) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P2 (0x1u << 2) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P3 (0x1u << 3) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P4 (0x1u << 4) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P5 (0x1u << 5) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P6 (0x1u << 6) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P7 (0x1u << 7) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P8 (0x1u << 8) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P9 (0x1u << 9) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P10 (0x1u << 10) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P11 (0x1u << 11) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P12 (0x1u << 12) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P13 (0x1u << 13) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P14 (0x1u << 14) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P15 (0x1u << 15) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P16 (0x1u << 16) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P17 (0x1u << 17) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P18 (0x1u << 18) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P19 (0x1u << 19) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P20 (0x1u << 20) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P21 (0x1u << 21) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P22 (0x1u << 22) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P23 (0x1u << 23) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P24 (0x1u << 24) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P25 (0x1u << 25) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P26 (0x1u << 26) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P27 (0x1u << 27) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P28 (0x1u << 28) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P29 (0x1u << 29) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P30 (0x1u << 30) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
#define PIO_P_IMR_P31 (0x1u << 31) /**< \brief (PIO_P_IMR) Input Change Interrupt Mask */
/* -------- PIO_P_ISR : (PIO0 Offset: N/A) PIO Privilege Interrupt Status Register -------- */
#define PIO_P_ISR_P0 (0x1u << 0) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P1 (0x1u << 1) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P2 (0x1u << 2) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P3 (0x1u << 3) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P4 (0x1u << 4) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P5 (0x1u << 5) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P6 (0x1u << 6) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P7 (0x1u << 7) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P8 (0x1u << 8) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P9 (0x1u << 9) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P10 (0x1u << 10) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P11 (0x1u << 11) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P12 (0x1u << 12) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P13 (0x1u << 13) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P14 (0x1u << 14) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P15 (0x1u << 15) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P16 (0x1u << 16) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P17 (0x1u << 17) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P18 (0x1u << 18) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P19 (0x1u << 19) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P20 (0x1u << 20) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P21 (0x1u << 21) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P22 (0x1u << 22) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P23 (0x1u << 23) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P24 (0x1u << 24) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P25 (0x1u << 25) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P26 (0x1u << 26) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P27 (0x1u << 27) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P28 (0x1u << 28) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P29 (0x1u << 29) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P30 (0x1u << 30) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
#define PIO_P_ISR_P31 (0x1u << 31) /**< \brief (PIO_P_ISR) Input Change Interrupt Status */
/* -------- PIO_P_SIO_UAR : (PIO0 Offset: N/A) PIO Privilege Set I/O User Register -------- */
#define PIO_P_SIO_UAR_P0 (0x1u << 0) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P1 (0x1u << 1) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P2 (0x1u << 2) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P3 (0x1u << 3) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P4 (0x1u << 4) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P5 (0x1u << 5) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P6 (0x1u << 6) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P7 (0x1u << 7) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P8 (0x1u << 8) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P9 (0x1u << 9) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P10 (0x1u << 10) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P11 (0x1u << 11) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P12 (0x1u << 12) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P13 (0x1u << 13) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P14 (0x1u << 14) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P15 (0x1u << 15) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P16 (0x1u << 16) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P17 (0x1u << 17) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P18 (0x1u << 18) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P19 (0x1u << 19) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P20 (0x1u << 20) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P21 (0x1u << 21) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P22 (0x1u << 22) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P23 (0x1u << 23) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P24 (0x1u << 24) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P25 (0x1u << 25) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P26 (0x1u << 26) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P27 (0x1u << 27) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P28 (0x1u << 28) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P29 (0x1u << 29) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P30 (0x1u << 30) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
#define PIO_P_SIO_UAR_P31 (0x1u << 31) /**< \brief (PIO_P_SIO_UAR) Set I/O in User-Access mode */
/* -------- PIO_P_SIO_PAR : (PIO0 Offset: N/A) PIO Privilege Set I/O Privilege Register -------- */
#define PIO_P_SIO_PAR_P0 (0x1u << 0) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P1 (0x1u << 1) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P2 (0x1u << 2) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P3 (0x1u << 3) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P4 (0x1u << 4) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P5 (0x1u << 5) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P6 (0x1u << 6) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P7 (0x1u << 7) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P8 (0x1u << 8) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P9 (0x1u << 9) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P10 (0x1u << 10) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P11 (0x1u << 11) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P12 (0x1u << 12) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P13 (0x1u << 13) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P14 (0x1u << 14) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P15 (0x1u << 15) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P16 (0x1u << 16) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P17 (0x1u << 17) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
