ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/pio.h
#define PIO_P_SIO_PAR_P18 (0x1u << 18) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P19 (0x1u << 19) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P20 (0x1u << 20) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P21 (0x1u << 21) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P22 (0x1u << 22) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P23 (0x1u << 23) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P24 (0x1u << 24) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P25 (0x1u << 25) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P26 (0x1u << 26) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P27 (0x1u << 27) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P28 (0x1u << 28) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P29 (0x1u << 29) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P30 (0x1u << 30) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
#define PIO_P_SIO_PAR_P31 (0x1u << 31) /**< \brief (PIO_P_SIO_PAR) Set I/O in Privileged-Access mode */
/* -------- PIO_P_IOSSR : (PIO0 Offset: N/A) PIO Privilege I/O Security Status Register -------- */
#define PIO_P_IOSSR_P0 (0x1u << 0) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P0_PRIVILEGED_ACCESS (0x0u << 0) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P0_USER_ACCESS (0x1u << 0) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P1 (0x1u << 1) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P1_PRIVILEGED_ACCESS (0x0u << 1) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P1_USER_ACCESS (0x1u << 1) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P2 (0x1u << 2) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P2_PRIVILEGED_ACCESS (0x0u << 2) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P2_USER_ACCESS (0x1u << 2) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P3 (0x1u << 3) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P3_PRIVILEGED_ACCESS (0x0u << 3) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P3_USER_ACCESS (0x1u << 3) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P4 (0x1u << 4) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P4_PRIVILEGED_ACCESS (0x0u << 4) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P4_USER_ACCESS (0x1u << 4) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P5 (0x1u << 5) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P5_PRIVILEGED_ACCESS (0x0u << 5) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P5_USER_ACCESS (0x1u << 5) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P6 (0x1u << 6) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P6_PRIVILEGED_ACCESS (0x0u << 6) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P6_USER_ACCESS (0x1u << 6) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P7 (0x1u << 7) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P7_PRIVILEGED_ACCESS (0x0u << 7) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P7_USER_ACCESS (0x1u << 7) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P8 (0x1u << 8) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P8_PRIVILEGED_ACCESS (0x0u << 8) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P8_USER_ACCESS (0x1u << 8) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P9 (0x1u << 9) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P9_PRIVILEGED_ACCESS (0x0u << 9) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P9_USER_ACCESS (0x1u << 9) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P10 (0x1u << 10) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P10_PRIVILEGED_ACCESS (0x0u << 10) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P10_USER_ACCESS (0x1u << 10) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P11 (0x1u << 11) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P11_PRIVILEGED_ACCESS (0x0u << 11) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P11_USER_ACCESS (0x1u << 11) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P12 (0x1u << 12) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P12_PRIVILEGED_ACCESS (0x0u << 12) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P12_USER_ACCESS (0x1u << 12) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P13 (0x1u << 13) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P13_PRIVILEGED_ACCESS (0x0u << 13) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P13_USER_ACCESS (0x1u << 13) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P14 (0x1u << 14) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P14_PRIVILEGED_ACCESS (0x0u << 14) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P14_USER_ACCESS (0x1u << 14) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P15 (0x1u << 15) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P15_PRIVILEGED_ACCESS (0x0u << 15) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P15_USER_ACCESS (0x1u << 15) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P16 (0x1u << 16) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P16_PRIVILEGED_ACCESS (0x0u << 16) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P16_USER_ACCESS (0x1u << 16) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P17 (0x1u << 17) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P17_PRIVILEGED_ACCESS (0x0u << 17) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P17_USER_ACCESS (0x1u << 17) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P18 (0x1u << 18) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P18_PRIVILEGED_ACCESS (0x0u << 18) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P18_USER_ACCESS (0x1u << 18) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P19 (0x1u << 19) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P19_PRIVILEGED_ACCESS (0x0u << 19) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P19_USER_ACCESS (0x1u << 19) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P20 (0x1u << 20) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P20_PRIVILEGED_ACCESS (0x0u << 20) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P20_USER_ACCESS (0x1u << 20) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P21 (0x1u << 21) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P21_PRIVILEGED_ACCESS (0x0u << 21) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P21_USER_ACCESS (0x1u << 21) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P22 (0x1u << 22) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P22_PRIVILEGED_ACCESS (0x0u << 22) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P22_USER_ACCESS (0x1u << 22) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P23 (0x1u << 23) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P23_PRIVILEGED_ACCESS (0x0u << 23) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P23_USER_ACCESS (0x1u << 23) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P24 (0x1u << 24) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P24_PRIVILEGED_ACCESS (0x0u << 24) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P24_USER_ACCESS (0x1u << 24) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P25 (0x1u << 25) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P25_PRIVILEGED_ACCESS (0x0u << 25) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P25_USER_ACCESS (0x1u << 25) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P26 (0x1u << 26) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P26_PRIVILEGED_ACCESS (0x0u << 26) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P26_USER_ACCESS (0x1u << 26) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P27 (0x1u << 27) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P27_PRIVILEGED_ACCESS (0x0u << 27) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P27_USER_ACCESS (0x1u << 27) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P28 (0x1u << 28) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P28_PRIVILEGED_ACCESS (0x0u << 28) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P28_USER_ACCESS (0x1u << 28) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P29 (0x1u << 29) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P29_PRIVILEGED_ACCESS (0x0u << 29) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P29_USER_ACCESS (0x1u << 29) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P30 (0x1u << 30) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P30_PRIVILEGED_ACCESS (0x0u << 30) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P30_USER_ACCESS (0x1u << 30) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
#define PIO_P_IOSSR_P31 (0x1u << 31) /**< \brief (PIO_P_IOSSR) I/O Security Status */
#define   PIO_P_IOSSR_P31_PRIVILEGED_ACCESS (0x0u << 31) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. */
#define   PIO_P_IOSSR_P31_USER_ACCESS (0x1u << 31) /**< \brief (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. */
/* -------- PIO_P_IOFR : (PIO0 Offset: N/A) PIO Privilege I/O Freeze Configuration Register -------- */
#define PIO_P_IOFR_FPHY (0x1u << 0) /**< \brief (PIO_P_IOFR) Freeze Physical Configuration */
#define PIO_P_IOFR_FINT (0x1u << 1) /**< \brief (PIO_P_IOFR) Freeze Interrupt Configuration */
#define PIO_P_IOFR_FRZKEY_Pos 8
#define PIO_P_IOFR_FRZKEY_Msk (0xffffffu << PIO_P_IOFR_FRZKEY_Pos) /**< \brief (PIO_P_IOFR) Freeze Key */
#define PIO_P_IOFR_FRZKEY(value) ((PIO_P_IOFR_FRZKEY_Msk & ((value) << PIO_P_IOFR_FRZKEY_Pos)))
#define   PIO_P_IOFR_FRZKEY_PASSWD (0x494F46u << 8) /**< \brief (PIO_P_IOFR) Writing any other value in this field aborts the write operation of the WPEN bit. */
/* -------- PIO_P_SCDR : (PIO0 Offset: 0x1500) PIO Privilege Slow Clock Divider Debouncing Register -------- */
#define PIO_P_SCDR_DIV_Pos 0
#define PIO_P_SCDR_DIV_Msk (0x3fffu << PIO_P_SCDR_DIV_Pos) /**< \brief (PIO_P_SCDR) Slow Clock Divider Selection for Debouncing */
#define PIO_P_SCDR_DIV(value) ((PIO_P_SCDR_DIV_Msk & ((value) << PIO_P_SCDR_DIV_Pos)))
/* -------- PIO_P_WPMR : (PIO0 Offset: 0x15E0) PIO Privilege Write Protection Mode Register -------- */
#define PIO_P_WPMR_WPEN (0x1u << 0) /**< \brief (PIO_P_WPMR) Write Protection Enable */
#define PIO_P_WPMR_WPITEN (0x1u << 1) /**< \brief (PIO_P_WPMR) Write Protection Interrupt Enable */
#define PIO_P_WPMR_WPKEY_Pos 8
#define PIO_P_WPMR_WPKEY_Msk (0xffffffu << PIO_P_WPMR_WPKEY_Pos) /**< \brief (PIO_P_WPMR) Write Protection Key */
#define PIO_P_WPMR_WPKEY(value) ((PIO_P_WPMR_WPKEY_Msk & ((value) << PIO_P_WPMR_WPKEY_Pos)))
#define   PIO_P_WPMR_WPKEY_PASSWD (0x50494Fu << 8) /**< \brief (PIO_P_WPMR) Writing any other value in this field aborts the write operation of WPEN. Always reads as 0. */
/* -------- PIO_P_WPSR : (PIO0 Offset: 0x15E4) PIO Privilege Write Protection Status Register -------- */
#define PIO_P_WPSR_WPVS (0x1u << 0) /**< \brief (PIO_P_WPSR) Write Protection Violation Status */
#define PIO_P_WPSR_WPVSRC_Pos 8
#define PIO_P_WPSR_WPVSRC_Msk (0xffffu << PIO_P_WPSR_WPVSRC_Pos) /**< \brief (PIO_P_WPSR) Write Protection Violation Source */

/*@}*/

#endif /* _PIC32CX_PIO_COMPONENT_ */
